---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReinforcement
source: html/441cd6fa-a1a2-c664-8088-253f463dbc21.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReinforcement Property

Can't find a host for Area Reinforcement.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceAreaReinforcement { get; }
```